Revit 2024 API
FabricationPart.ServiceName Property
 The name of the service associated with the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string ServiceName { get; }
Visual Basic
Public ReadOnly Property ServiceName As String
	Get
Visual C++
public:
property String^ ServiceName {
	String^ get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace